# IsVisibleByDefault Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Workset..::..IsVisibleByDefault Property
Workset Class See Also
---
Whether the workset is visible by default.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsVisibleByDefault { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsVisibleByDefault As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsVisibleByDefault {
	bool get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | WorksetDefaultVisibilitySettings is not applicable to family documents. |

# See Also
Workset Class
Autodesk.Revit.DB Namespace